text_1 = """Привет!

*Пройди опрос и получи полный гайд!*
Хочешь консультацию о тренировках в клубе  IFIT?"""

lead_magnets = {
    "Петли": {
        "image": "./static/trx.jpg",
        "caption": "Петли TRX",
        "text": """TRX-тренировка - это настоящая революция в мире фитнеса!
         Это эффективные функциональные тренировки с собственным весом, основной снаряд-петли. Петли TRX-самый легкий тренажер! 
         С помощью упражнений TRX можно тренировать все тело, а так же задействовать мышцы-стабилизаторы, которые работают гораздо меньше при выполнении обычных упражнений. 
         Упражнения с TRX помогают улучшить осанку и укрепить позвоночник. Тренируясь на петлях можно выполнять силовые, кардио, функциональные и комбинированные тренировки.
         Для тех, кто хочет похудеть, будет свой темп выполнения упражнений, так же можно улучшить общий тонус мышц и получить рельеф на всем теле. При помощи петель 
         осуществляется качественное быстрое похудение, так как упражнения довольно сложные. Они будут сжигать много калорий, не давая жиру откладываться в проблемных местах.
         Хотите улучшить качество тела? Развить выносливость? Быть стройным и подтянутым? Петли TRX - отличное решение!""",
    },
    "Пилатес": {
        "image": "./static/pilates.MP4",
        "caption": "Пилатес 🔠",
        "text": """ Пилатес - это система тренировок, направленная на укрепление тела, выработку правильной осанки, развитие гибкости, улучшение плавности и точности движений.
        На занятиях вас ждет медленный темп, работа с дыханием, улучшение гибкости и повижности суставов, укрепление мышц живота и спины.
        ВАЖНО! Пилатес подходит для всех возрастов, а так же нет противопоказаний для занятий в волшебное время беременности!
        С точки зрения единства тела и духа тренировки похожи на йогу, но пилатес появился гораздо позже, и в нем преобладают динамичные элементы.
        Если йога больше ориентрована на статику, то пилатес - на движение. По технической насыщенности он проще йоги, не предусматривает сложных поз.
        При регулярных занятиях исправляется осанка, улучшается координация. Доказано: пилатес способствует устранению болей в спине и пояснице, происходит выравнивание и стабилизация позвоночника, снижается повышенное давление, улучшается работа сердечно-сосудистой системы.
        Дискомфорт в пяснице, шее, между лопаток, коленях? Головные боли, бессонница, упадок сил, вялость? Лишний вес, висящий живот и драблость тела?
        Пилатес поможет решить эти проблемы!"""
    },
    "Soft fitness": {
        "image": "./static/soft_fit.jpg",
        "caption": "Soft fitness",
        "text": """Желание начать тренироваться есть уже давно, но никак не можешь найти свой формат?
        Начни с софт фитнеса! Это базовые шаги, которые под силу каждому.
        На тренировке тебя ждет:умеренный темп, хорошая силовая нагрузка, кардио блок, мягкий стретчинг.
        Боишься больших физических нагрузок? Новичок? Восстанавливаешься после болезни?
        Начни с очень комфортной тренировки SOFT FITNESS!
        """
    },
    "90-60-90": {
        "image": "./static/90-60-90.jpg",
        "caption": "90-60-90",
        "text": """ Силовая функциональная тренировка.
        Основная задача тренировки -  развитие основных функциональных особенностей: сила, ловкость, выносливость, скорость, гибкость, баланс.
        Для каких целей подходит 90-60-90?
        Ответ: Похудение, красивая осанка, рельефное и подтянутое тело, красивый пресс, укрепление не только мышц кора , но и всего тела.
        Подойдет для тех, кто хочет исправить осанку, визуально уменьшить талию и увеличить объем ягодиц."""
    },
    
    "Степ + сила": {
       "image": "./static/stepplussila.jpg",
        "caption": "Степ+сила",
        "text": """Хотите эффективную кардио нагрузку для похудения?
        Тогда вам нужна степ аэробика.
        За час тренировки вы сможете сжечь 400-500 ккал.
        Идеальная тренировка для тех, кто ведет сидячий образ жизни:
        - профилактика остеопороза и артрита
        - благотворно влияет на суставы. Упражнения на сгибание и разгибание способствует выделению суставной жидкости
        - в организме ускоряется обмен веществ
        - улучшается работа легких и сердца
        - усовершенствование координации
        - включает комплекс упражнений на укрепление мускулатуры""" 
    },
    "Ноги, ягодицы, пресс":{
        "image": "./static/njp.MP4",
        "caption": "Ноги ягодицы пресс",
        "text": """Название тренировки говорит само за себя!
        - укрепление ног, ягодиц и мышц живота
        - повышение общей выносливости организма
        - улучшение внешнего вида(пропорциональная и подтянутая фигура)
        - сильный корпус (улучшение осанки и поддержка правильного положения тела)
        - улучшение стабильности (крепкий пресс обеспечивает стабильность и контроль движений в повседневной жизни)
        - улучшение метаболизма (тренировка способствует сжиганию лишних калорий)
        - эстетический вид (подтянутый выразительный живот, ноги и ягодицы повысят вашу уверенность в себе и поднимут самооценку)"""
    },
    "45/15": {
        "image": "./static/45-15.jpg",
        "caption": "45/15",
        "text": """Силовая функциональная тренировка.
        Основна задача развить у вас основные функциональные особенности, такие как сила, ловкость, выносливость, скорость, гибкость, баланс.
        Тренировка 45/15 делится на 11 блоков, каждый блок 4 минуты 15 сек. Блок в свою очередь делится на 4 временных отрезка в которых 45 секунд вы работаете и 15 секунд отдыхаете.
         Благодаря таким тренировкам ваше тело обретет красивые формы, появится выносливость, поднимется ваши самооценка и настроение."""
    },
    "FITMIX": {
        "image": "./static/fitmix.jpg",
        "caption": "FITMIX",
        "text": """Fitmix - это комплексный подход к физической активности, который сочетает в себе элементы различных видов фитнеса в рамках одной тренировки.
         ✅ Главная идея - не ограничиваться одним типом нагрузки, а гармонично развивать все физические качества тела.
         Такая тренировка включает в себя кардионагрузки, силовые упраженения, функциональный тренинг, элементы йоги или пилатеса, растяжка и мобильность.
         ✅ Главное приемущество тренировки - это коплексное развитие тела, эффективное сжигание калорий, предотвращение плато и адаптации к однообразным упражнениям.
         Хотите внести немного разнообразия в свой тренировочный процесс?
         Добавьте FITMIX в ваше расписание!"""
    },
    "Стретчинг": {
        "image": "./static/stretching.jpg",
        "caption": "Стретчинг",
        "text": """Стретчинг - это растяжка мышц и связок. Такие упражнения приносят много пользы и разрешены почти всем.
        А для женщин стретчинг приготовил отдельные приемущества!
        ✅ Растяжка против депрессии и переутомления: после растяжки вы будете чувствовать подъем энергии еще пару часов.
        Стретчинг показан при депрессивных расстройствах.
        ✅ Стретчинг улучшает кровообращение. Во время растяжки кровь активнее приливает к мышцам. Из-за этого они становятся выносливее, лучше восстанавливаются
        Налаживается кислородный обмен в организме, что благотворно сказывается на состоянии здоровья.
        ✅ Вы становитесь изящнее.
        Растяжка делает вас более пластичным и гибким, а это не может не отразится на вашей походке. Ваши движения станут более плавными и изящными. А еще появится хорошее чувство равновесия.
        ✅ Идеален для нулевой физической подготовки. Если вы живете в сидячем режиме, стретчинг - именно та нагрузка, с которой стоит начинать жить активнее. 
        Он не потребует больших затрат энергии, к  которым вы не готовы, но расшевелит ваши мышцы и позволит им не прийти в полный упадок.
        ✅ Стретчинг делает вас подвижным.
        Упражнения на растяжку приводят к тому, что тело становится подвижнее, а движения свободнее. Постоянные занятия стретчингом позволяют достичь своего природного предела гибкости."""
    },
    "Узнать больше": {
         "image": "./static/raspisanie.jpg",
        "caption": "Актуальное расписание",
        "text": """Наш клуб работает с 2017 года! Наши тренеры это высококвалифицированные специалисты с многолетним опытом работы!
        👍🏼 На каждой тренировке вас ждет ответственное, внимательное и доброжелательное отношение к вам и вашему здоровью!
        🏛 Мы находимся по адресу г.Гродно ул. Кабяка 8а,2 этаж.
        📞 Записаться на тренировку и задать дополнительные вопросы можно по телефону +375 29 5555555
        Больше фото, видео и описания тренировок можно увидеть на нашей странице в Instagram (https://www.instagram.com/ifit_fitnessclub?igsh=MW93eDhhNDR3d2tmaA==)
        ЖДЕМ ВАС НА ТРЕНИРОВКЕ В КЛУБЕ IFIT!!!"""
    }

}
